Revit 2027 API
BuiltInFailures.SystemsFailures.FamilyDoesntMatchSystemPropertiesWasDisconnected Property
 The family no longer matches the properties for the System. Disconnect the family from the System?
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId FamilyDoesntMatchSystemPropertiesWasDisconnected { get; }
Public Shared ReadOnly Property FamilyDoesntMatchSystemPropertiesWasDisconnected As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ FamilyDoesntMatchSystemPropertiesWasDisconnected {
	FailureDefinitionId^ get ();
}
static member FamilyDoesntMatchSystemPropertiesWasDisconnected : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SystemsFailures Class
Autodesk.Revit.DB Namespace